# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [1]:
import pandas as pd
df = pd.read_csv('1_Sales.csv')
df.head(5)

  SalesRep Region Month    Sales  Units Sold
0      Amy  North   Jan  23040.0       239.0
1      Amy  North   Feb  24131.0        79.0
2      Amy  North   Mar  24646.0        71.0
3      Amy  North   Apr  22047.0        71.0
4      Amy  North   May  24971.0         NaN

In [3]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Sales,47.0,24209.425532,2671.207948,19625.0,22348.5,24218.0,25742.0,29953.0
Units Sold,47.0,206.617021,204.332269,68.0,86.5,114.0,227.0,852.0

### Info on Unique Values

In [4]:
df['SalesRep'].unique()

array(['Amy', 'Bob', 'Chuck', 'Doug'], dtype=object)

In [5]:
df['SalesRep'].nunique()

4

In [6]:
df['SalesRep'].value_counts()

Amy      12
Bob      12
Chuck    12
Doug     12
Name: SalesRep, dtype: int64

### Selecting Data

In [7]:
#Select from DataFrame using criteria from multiple columns
seldf = df[(df['Units Sold']>100) & (df['Month']=='Jan')]

In [8]:
seldf

   SalesRep Region Month    Sales  Units Sold
0       Amy  North   Jan  23040.0       239.0
12      Bob  North   Jan  20024.0       103.0

### Applying Functions

In [9]:
def times2(x):
    return x*2

In [10]:
df['Units Sold'].apply(times2).head()

0    478.0
1    158.0
2    142.0
3    142.0
4      NaN
Name: Units Sold, dtype: float64

In [11]:
df['Units Sold']

0     239.0
1      79.0
2      71.0
3      71.0
4       NaN
5      92.0
6     175.0
7      87.0
8     557.0
9      95.0
10    706.0
11    180.0
12    103.0
13    267.0
14     96.0
15     74.0
16    231.0
17    164.0
18     68.0
19    114.0
20     84.0
21    260.0
22    109.0
23    465.0
24     95.0
25    148.0
26     83.0
27     96.0
28    453.0
29    760.0
30    155.0
31    769.0
32    114.0
33     83.0
34     70.0
35    178.0
36     92.0
37    852.0
38     86.0
39    223.0
40    242.0
41     95.0
42     82.0
43    103.0
44    146.0
45    120.0
46     81.0
47    198.0
Name: Units Sold, dtype: float64